{
  "name": "Shady Dog Record &amp; Disc Exchange",
  "rating": 4.4,
  "reviewCount": 42,
  "phone": "(610) 644-1160",
  "address": "638 Lancaster Ave",
  "city": "Berwyn",
  "state": "PA",
  "zip": "19312",
  "website": "http://www.shadydog.com/",
  "hours": {
    "Mon": "11:00 AM - 6:00 PM",
    "Wed": "11:00 AM - 6:00 PM",
    "Fri": "11:00 AM - 7:00 PM",
    "10:00 AM - 5:00 PM": "Open now",
    "Sun": "10:00 AM - 4:00 PM"
  },
  "priceRange": null,
  "categories": [],
  "photos": [
    "https://s3-media0.fl.yelpcdn.com/bphoto/td_DAr1RUorsen0tjosw1w/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/2WBkfReQ4qrjdPT2tTL2LA/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/0R4sCxTiQsEy-CmWOpcSzw/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/eG43aVtZVvdTCpfGbMdWXg/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/uR46wOKZXx48aydPtWD0oQ/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/BtgVfns3z29iyjIbhHGhIQ/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/assets/public/user_60_square.yji-8b51f2026d9de1b3.png",
    "https://s3-media0.fl.yelpcdn.com/assets/public/user_60_square.yji-8b51f2026d9de1b3.png",
    "https://s3-media0.fl.yelpcdn.com/photo/LPRkCdEfCaWNhXuaCnRKIQ/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/DSDp-MDKkvUMxu_lNtQx_w/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/ZTdqEthRwFFQVPPyjKaR7Q/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/WClWI8YE7lxt2xSBt3hoUg/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/w-KPgDpKn4W6sWHfWdXHDw/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/hnmSn11DmtpzWmOgRE5RMg/60s.jpg"
  ],
  "amenities": null,
  "specialties": null,
  "reviews": [
    {
      "stars": 5,
      "text": "Just the best anywhere outside of Philly in the region. To us collectors of a certain vintage, a throwback to exactly \"how it used to be\". What's missing is the tyrannical attitude record store owners used to have pre-internet!Prices on-point, generally. Repeat business is rewarded with good chats, and the occasional deal.Sure, you can buy in the internet... but why not support a local business, and check the condition for yourself?They get fantastic stuff, in unpredictable (ofc) waves. Let's put it this way, I have passed up hard to find records there that I still regret years later not getting. Genre-wise, heavy and the rock and jazz, but the occasional synth-pop or electronic gem will surface from time to time. Final verdict: If you want the increasingly rare authentic record store experience, come here.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 2,
      "text": "Made a return visit here the other day, my first in a while. A bit hard to browse, as records and CDs are stacked everywhere. That's standard in shops with good inventory, so no worries there. What WAS a problem is that one of the employees was sitting in the upper section, where the CDs are, smoking. The place REEKED of smoke, and I had to leave after only a few minutes. Even then, my clothes stunk of smoke--like they did back in the 1990s after a night of hanging out in bars in Philly. Not cool.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 4,
      "text": "Stopped here on a Wednesday afternoon and there was one another shopper. Cramped in just the right way. Stacks of LPs. Organized in sections but there were records everywhere. Hard to find exactly what you're looking for but the guy working was able to point me in the right direction a few times. Prices can be cheap ($1.98) but didn't check grade/condition. Some new releases priced $20-$30 which is good. Had CDs priced below $10. They are remodeling apparently. Will be back with more time to spare.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "First time at Shady Dog! This is a great place to bring your vinyl for selling and buying. Dave was so nice, he went through all of my albums, one by one, first checking to see if he wanted to buy it and secondly checking for scratches. All the while we chatted about artists, concerts, and the crazy condition that some people bring their albums into him. I walked away with a nice chunk of change!! Everybody says the store is dumpy, but if you grew up in the 70s, the sight (and the vintage smell) will bring you back to those days! To those who bought their albums from Mad's Records in Ardmore, this is the place to see! Thanks Dave!",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Dark, disorganized, and a bit dumpy... but I loved it! Find classic used LPs or CDs at low prices. Friendly owners will chat about any artist you know and guarantee no scratches or you'll get a refund. Well worth a visit if you enjoy adventure.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 1,
      "text": "I have been to this location three times to purchase 45 RPM records. The first visit the owner wasn't in but another man made me a pretty good deal on some. The second time I came the owner Dave was in and he also made me a pretty decent deal. Today however was a totally different situation. Dave the owner was there and after spending an hour digging through boxes which by the way are all over the floor and not in any particular order just a big mess he went through the records one at a time and tried to charge me a huge amount for them claiming some of them were worth a lot of money and I knew that. My opinion is if they were worth a lot of money maybe he would display them on shelves rather than have them piled in boxes on the floor in a big mess. I asked him to take out the ones that had big value and he removed six of them leaving 45 records. He then asked me again for more than a dollar a record when last time I paid barely half a dollar per record. He would not deal and seems to think keeping the records and not getting $30 for them and piling them back onto the floor makes more sense than making a customer who it is my third from out of town visit happy. I Don't understand these record store owners sometimes they listen to their music more than sell records. I won't be back!I have been to several record stores where they have sold me records for three for a dollar or even five for a dollar and they are neatly displayed on shelves or in racks in alphabetical order. This store is a big mess even with CDs piled all over the place and they don't seem to care other than the sit and listen to their music. The customer seems last in their mind.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Great selection (both new and used) and always different inventory. The people are pretty knowledgeable and friendly I will definitely be going back.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Memory heaven.  My daughter and I spent almost 2 hours in the store yesterday looking at and buying records and cds. You name it, they have it.  Artists you don't find everyday.  Albums you haven't seen in 20 (ok 30) or more years. Everything is alphabetized.  Such a great experience.  When we walked in, we were greeted and informed of the sales.  We bought about 30 or so items and and before he even gave us the \"sale\" price, he was knocking dollars off every item. Then added the discount. Damn!  Had I known that, I could have bought a few more, lol.  Just kidding.  An absolutely great experience.  Between the diversity of what was playing in the store to flipping through row after row of albums and remembering this cover or that song or the way the album you had back in 197/8 something always skipped at this song or the inside record jacket.  Such memories. I thought I was back in high school.  And that was 30+ years ago.  My teenage daughter who definitely has different tastes than I was equally thrilled to find her stash of goodies. \"OMG! They have X. (Inset name of group I have never heard of).   She came away quite happy as well.  Bit of a drive for us to get out there, but as happy as we were, I can definitely see another visit or two or three in the coming months. I did not get either gentlemen's name, but I want to thank them both for all their patience and time.  I know you were looking to close and we kept finding one more item (and one more).  Thank you both.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Great place in Berwyn not big but real small but that's okay size is not everything!Its got character which is big in my book first time here and I will come back picked up a used Talking Heads Cd and to boot it's a West German in nature which puts another angle in it how would you like to be a CD without a country I sure wouldn't!I guess if the Iron Curtain would not of fell this Cd would not feel obsolete!",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 4,
      "text": "I've been here twice and was generally pleased on both visits.The guys that work there are very knowledgeable and enthusiastic about music while being very friendly.The selection is great for classic rock and the like, they also have a back room with tons of Jazz and Classical.The prices are right in the pocket of not being too cheap but not expensive at all. The first time I went in they were having a 15% off sale which was cool. You can tell they only sell records that are in decent to great condition because everything I bought was more or less in great shape. The 2 dollar bin has yielded a couple of great finds that were in excellent condition as well.I sold some records here too, they picked through to see what they wanted and offered less than I expected it to be but offered a larger price in store credit. I bought the allotment of my store credit and went over that amount and they still called it even so that was a nice gesture.Like others said, it's on the small side, you have to move out of the way for people sometimes and move a box here and there to look whats under it, but I'd rather have a store that has too many records than too little.I will absolutely keep checking back at this place for their fair prices and very good selection with guys who really know the music they are selling.",
      "date": null,
      "reviewer": null
    }
  ],
  "highlights": [],
  "yelpUrl": "https://www.yelp.com/biz/shady-dog-record-and-disc-exchange-berwyn?adjust_creative=IDgT_B7bwvrRXIkYlHml_A&utm_campaign=yelp_api_v3&utm_medium=api_v3_business_search&utm_source=IDgT_B7bwvrRXIkYlHml_A",
  "totalReviewsScraped": 10,
  "scrapedAt": "2026-02-14T16:34:09.636Z"
}