{
  "name": "Positively Records",
  "rating": 4.5,
  "reviewCount": 33,
  "phone": "(215) 945-8063",
  "address": "4151 Woerner Ave",
  "city": "Levittown",
  "state": "PA",
  "zip": "19055",
  "website": null,
  "hours": {
    "Mon": "11:00 AM - 6:00 PM",
    "11:00 AM - 6:00 PM": "Open now",
    "Wed": "11:00 AM - 6:00 PM",
    "Fri": "11:00 AM - 6:00 PM",
    "Sun": "11:00 AM - 5:00 PM"
  },
  "priceRange": null,
  "categories": [],
  "photos": [
    "https://s3-media0.fl.yelpcdn.com/bphoto/hHWQL8sacs70FHM7sHQg7Q/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/cKjNtAXpb65sUncguRwEDw/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/NcmdsgGHvyfjXiMs6-ALvw/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/CykA3s6Xcjs7Vz2PYWpNGg/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/DfQcT458YScyKZjsDWZZ5w/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/Q-yl55rouwAQQGa0XG54qQ/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/8uQZEF3R6ESag94Bhu1zcg/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/GqxvNFqXJJ608Kj5blKxvw/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/assets/public/user_60_square.yji-8b51f2026d9de1b3.png",
    "https://s3-media0.fl.yelpcdn.com/bphoto/4Ey9uQeTiii_dLRWcrIFAg/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/-oQl43qzySgbhE8XpUEhRg/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/qKhvZeqipYTgTW5xiFw1Gg/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/_vpkKHIXBhxeFPmLLAMckw/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/hHWQL8sacs70FHM7sHQg7Q/348s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/cKjNtAXpb65sUncguRwEDw/348s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/NcmdsgGHvyfjXiMs6-ALvw/348s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/7oyXK28T_Xg6HvOoS34Chw/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/4uH8havhaBupwSBaNiQ6Pw/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/rEHdyHodXGkvTWqJQN3UZQ/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/dNB_Sk4LeQjJVUGjJgmMOA/60s.jpg"
  ],
  "amenities": null,
  "specialties": null,
  "reviews": [
    {
      "stars": 5,
      "text": "Positively Records absolutely lived up to its name. I'm visiting from California and stopped in today with my son, and we were immediately struck by the great vibe of the shop and the genuinely positive people running it. Super welcoming, no pretension, just real love for music.The clientele was friendly too. We ended up having some great conversations with other diggers about what we were flipping through, which always makes a record store visit memorable. The selection was better than I anticipated, with a really solid mix of new and used records, and the prices were more than fair.Highlight of the visit: scoring a near-mint copy of the 1977 first pressing of Foreigner. Couldn't have been more fitting to buy it today, with \"Cold As Ice\" on the tracklist and a windchill of -8 outside, it felt meant to be.If you're anywhere near Levittown, PA and love records, Positively Records is 100% worth the stop. I'll definitely be back next time I'm in town.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "While in high school and college in the early 90s, this was one of my go-to places to get music. I was very happy to see Positively is still there and going strong without a lot of changes since I used to visit back in the day. They still have a great selection of many different music styles. I was able to find a few great hard to find titles. If you can't find parking right outside the store, there's a big lot across the street at the supermarket. It's worth the visit to support this small business!",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "ServiceSelectionValueHere are a few finds that I came across recently:...",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 4,
      "text": "Small store packed full of records and memorabilia.  (Unfortunately, the memorabilia isn't for sale)While there is a more than decent selection, I believe it's just a little on the pricier side.  Not sure where he gets his prices from, it may be eBay's listing and not necessarily eBay's Sold listing.  But since he's pretty much the only game in the area, I guess he's able to charge what he wants.  Can't say there's room to negotiate either on the used records.  If it's marked 20, that's it. Whereas 10 - 15 miles away the same record may be 15-18.  Again, just a little in the pricey side. But when you're looking at a bunch those extra few bucks add up. We've been here a few times over the past year or so and we always come out with at least a handful.  Again, nice selections.  Wish the memorabilia was for sale though.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 1,
      "text": "Extremely disappointed with quality of service. Showed absolutely no interest in a prospective customer.  Definitely not worth the time or effort to go to this establishment.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "I want to give positively records an A+++ !!!!!This store has an amazing amount of vinyl records from all kinds of artists!!! The gentleman who owns the store is very kind friendly and knowledgeable about music and his selections in the store.A year ago I had to sell some of my vinyl records and he reviewed each one for quality and gave me a very fair price. I appreciate his honesty and integrity and will stop here for years to come! Check out positively records you won't regret it!! You will leave very happy !!!  Dawn  from Philadelphia",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Great place to find CDs and vinyl. Something for every taste here. I've been coming here for a few years now.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Great store!  Kevin (owner) is amazing!  Excellent customer service, cant say eenough great things about this store.  Great selection of used/new vinyl and happy to special order anything they may not have in stock.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Positively Records is, without a doubt, the best record store around. With an extensive catalog consisting of thousands of artists over countless genres, you're bound to find what you're looking for here--whether it's a rare collectible, seldom-sought-after single, or something entirely new to listen to. And hey, why stop at music? You can also purchase used DVDs here as well.If I could give this establishment more than 5 stars, I would--but unfortunately, a perfect score will have to suffice!",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "It is incredible that we never discovered this jewel of a place until very recently!  Looking for a Valentine's Day gift for my husband, I decided to take him to Positively Records which I found by googling nearby record shops.  It is filled from top to bottom with excellent finds ~ music, memorabilia ~ and the nicest, most helpful staff at the helm.  Discounted vinyl, cds, amazing selection...this is a music lover's heaven.  One trip to Positively Records and you will be hooked.  Can't wait to visit again and again and again!",
      "date": null,
      "reviewer": null
    }
  ],
  "highlights": [],
  "yelpUrl": "https://www.yelp.com/biz/positively-records-levittown",
  "totalReviewsScraped": 10,
  "scrapedAt": "2026-02-17T17:28:27.684Z"
}