{
  "name": "Mostly Books",
  "rating": 4.1,
  "reviewCount": 69,
  "phone": "(215) 238-9838",
  "address": "529 Bainbridge St",
  "city": "Philadelphia",
  "state": "PA",
  "zip": "19147",
  "website": "http://mostlybooksphilly.com/",
  "hours": {
    "Mon": "11:00 AM - 9:00 PM",
    "Wed": "10:00 AM - 9:00 PM",
    "Fri": "10:00 AM - 9:00 PM",
    "Sun": "10:00 AM - 9:00 PM"
  },
  "priceRange": null,
  "categories": [],
  "photos": [
    "https://s3-media0.fl.yelpcdn.com/bphoto/jJZ7saMHAWYwKUWlcwh4gA/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/woW-s78d5gZbktoZ5p-UBQ/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/S3kuHGlsakRcwJxTc4Gtpw/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/SeWCQ1hjxTUKAi81NXPvyA/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/-iZXjZAhxfy5ggTImEbtPQ/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/9oonnSjoHHGKqFyE99sTTA/l.jpg",
    "https://s3-media0.fl.yelpcdn.com/assets/public/user_60_square.yji-8b51f2026d9de1b3.png",
    "https://s3-media0.fl.yelpcdn.com/photo/oz_3ME5nGTD7i0Nqpozp8w/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/FEZ4cje7dKW1o8bnKZm4AA/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/sRRlLZ0S9FYhmGPEHZr4kA/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/k48CB0zjDqA0Jjm-5LEF4w/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/UlT3r00KAXzFPMxZMFDJ_w/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/Vg00_pV3gOC6NSypQIU47g/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/Q1mXCOqFH8hXKzKBslbQ1A/348s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/u-hqxGWJf9585BTtJVrUxA/348s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/ajqciWUwEW4m0KIlnQ_m3Q/348s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/W3LDQAUKh1rIuMinubCNKQ/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/7cKEt6xAK9eJtLcZtxD9mA/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/photo/263hhmvel8K7vyv7Y6f2bg/60s.jpg",
    "https://s3-media0.fl.yelpcdn.com/bphoto/ioZQhj9On0BXjV-NMEc-6Q/348s.jpg"
  ],
  "amenities": null,
  "specialties": null,
  "reviews": [
    {
      "stars": 4,
      "text": "Huge used bookstore! They have no database so you definitely need to spend some time in there and look around.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Loads of books. Arranged pretty well given the size of the shop and the amount of books.  It was a fun stop!!!!",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Perfect if you're seeking a bit of bookish chaos. There's something for everyone here, and the titles range in both era and quality. I was hoping to find some books on gardening and found that section to be a bit sparse, unfortunately, but otherwise the inventory size simply cannot be beat at the price range you'll see here.Ask the seller where to find things, or wander aimlessly through the sprawling collection. It's a choose your own adventure kind of thing ‍",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Incredible used book shop in QV, I am really glad I made some time to stop in here. I picked up a copy of \"The Dog Lover's Companion to Philadelphia\" and if my budget was unlimited, would have gone absolutely crazy. I also grabbed some interesting vintage-y postcards that they have up by the register, and look forward to sending those out to friends and family.The store seems to never end, twisting through room after room and also an upstairs section. The labelling system is the perfect mix of chaos and clarity, which I know doesn't really make sense. I didn't leave enough time to properly look through every section, but I can guarantee that you will find something to pique your interest if that's what you come in for.A great way to spend 30 minutes if you're exploring the neighborhood or in need of some additions to your bookshelf!",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 4,
      "text": "The setting in an old factory is really cool and the store has a lot of neat finds. Organization and selection can be hit or miss, but if you're in the mood for some shelf-digging you can't go wrong here. Prices are great.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 4,
      "text": "Great place with a ton of books, it's huge, all the categories you're looking. It even has medical textbooks! Though a bit older.Lots of novels in every category. There is huge world history, sociology and political section upstairs. Most used books, but you can definitely find some that are like new conditions. Prices generally range from 4.95-8.95. If you have books, interesting mementos, dvds, or cds for sale, take it here and she'll give you store credit. Depending on what it's worth, most of my paperbacks are 2-4 dollars a piece.Overall great service, if you need a specific book, they'll direct you to the right section.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Excellent selection.. with many unusual and rare items. Staff is friendly and knowledgeable ... particularly Sharon. Highly recommend",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "Such a cool bookstore, and really well priced books! They have cats guarding the books, so make sure to pet them for their service. Visit them next time you are on south street!",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 5,
      "text": "This place has that old used book shop feel that is starting to disappear. Everything is a little everywhere, which is just how I like it. I found some absolute gems on these shelves at fantastic prices. You just gotta take a little time to look. I had a lovely conversation with the people working and they were super friendly. They directed me to other shops in the area as well as made recommendations of can't miss spots! I had a phenomenal experience and can't wait to come back in to peruse the shelves again.",
      "date": null,
      "reviewer": null
    },
    {
      "stars": 4,
      "text": "This quaint bookstore is incredible. By quaint, I mean a three-story bookstore with every genre you can think of. I've found a lot of great, classic books here for such great prices. The lady that works (maybe the owner?) there is incredible and so friendly. I guess my only complaint would be that they don't have a database of books, so it's harder to keep track of what they do/don't have. Other than that, I highly recommend this bookstore if you are looking to pick up a good read for a great price.",
      "date": null,
      "reviewer": null
    }
  ],
  "highlights": [],
  "yelpUrl": "https://www.yelp.com/biz/mostly-books-philadelphia",
  "totalReviewsScraped": 10,
  "scrapedAt": "2026-02-15T21:51:21.346Z"
}